{"product_names":{"0":"SAMSUNG Galaxy S23 Ultra Cell Phone, Factory Unlocked Android Smartphone, 256GB, 200MP Camera, Night Mode, Long Battery Life, S Pen, US Version, 2023, Green : Cell Phones & Accessories","1":"iPhone 13 Pro Max, 128GB, Gold - Unlocked (Renewed Premium) : Cell Phones & Accessories","2":"Apple iPhone SE (2nd Generation), US Version, 128GB, Black - Unlocked (Renewed) : Cell Phones & Accessories","3":"Apple iPhone 11 Pro, US Version, 256GB, Space Gray - Unlocked (Renewed) : Cell Phones & Accessories","4":"Apple iPhone 12 Pro Max, 256GB, Graphite - Unlocked (Renewed Premium) : Cell Phones & Accessories","5":"Apple iPhone 11 Pro Max, 256GB, Gold - Fully Unlocked (Renewed Premium) : Cell Phones & Accessories","6":"Motorola Moto G Pure | 2021 | 2-Day battery | Unlocked | Made for US by Motorola | 3\/32GB | 13MP Camera | Deep Indigo : Cell Phones & Accessories","7":"Google Pixel 6a - 5G Android Phone - Unlocked Smartphone with 12 Megapixel Camera and 24-Hour Battery - Charcoal : Cell Phones & Accessories","8":"SAMSUNG Galaxy S22 Ultra Cell Phone, Factory Unlocked Android Smartphone, 128GB, 8K Camera & Video, Brightest Display Screen, S Pen, Long Battery Life, Fast 4nm Processor, US Version, 2022, Burgundy : Cell Phones & Accessories","9":"OnePlus Nord N200 | Large 5000mAh Battery | 5G Unlocked Android Smartphone U.S Version | 64GB Storage | 6.49\" Full HD+LCD Screen | 90Hz Smooth Display | Fast Charging | Triple Camera,Blue Quantum","10":"Tracfone Alcatel TCL A3, 32GB, Black - Prepaid Smartphone (Locked) : Cell Phones & Accessories","11":"Motorola Moto G Stylus | 2022 | 2-Day battery | Unlocked| Made for US by Motorola | 6\/128GB | 50MP Camera | Twilight Blue : Cell Phones & Accessories","12":"Apple iPhone 12, 64GB, Black - Fully Unlocked (Renewed) : Cell Phones & Accessories","13":"Tracfone Samsung Galaxy A03s, 32GB, Black - Prepaid Smartphone (Locked) : Cell Phones & Accessories","14":"Total by Verizon TCL 30 Z, 32GB, Black - Prepaid Smartphone (Locked) : Cell Phones & Accessories","15":"Belkin Screen Protector for Apple iPhone 11 or iPhone XR with Antimicrobial-Treated and Ion Exchange Strengthened and Included Easy Align Tray for Simple, Bubble Free Installation : Cell Phones & Accessories","16":"Total by Verizon TCL 30 Z, 32GB, Black - Prepaid Smartphone (Locked) : Cell Phones & Accessories","17":"iPhone Charger Fast Charging - Fuel Brites - 30W USB C PPS PD 3.0 GaN II Wall Charger, Fast Compact Foldable USB C Charger for iPhone 14 Pro Max, 13 Pro Max, 12, 11, iPad Pro, S23 Ultra - Orange : Cell Phones & Accessories","18":"Nokia 6300 4G | Unlocked | Dual SIM | WiFi Hotspot | Social Apps | Google Maps and Assistant | Cyan Green : Cell Phones & Accessories","19":"Xiaomi Redmi Note 11 Pro+ Plus 5G + 4G Global Version 256GB + 8GB Unlocked 6.67\" 108MP Camera Night (Not Verizon Sprint Boost Cricket Metro At&T) + (w\/Fast Car Charger 51w Bundle) (Star Blue) : Cell Phones & Accessories","20":"Simple Mobile Samsung Galaxy A23 5G, 64GB, Black - Prepaid Smartphone (Locked) : Cell Phones & Accessories","21":"Bicycle Phone Mount by Delta Cycle - Lockable Bike Phone Mount Handlebar Adjusts to Any Size Bar - Fits Any Phone Or iPhone Up to 3.5\" x 7.8\" - Easily Accessible Bike Phone Holder : Cell Phones & Accessories","22":"iOttie Car Charger Easy One Touch Wireless 2 Qi Charging CD Slot + Air Vent Combo Phone Mount for iPhone, Samsung Galaxy, Huawei, LG, Smartphones : Cell Phones & Accessories","23":"Nokia 3.4 | Android 10 | Unlocked Smartphone | 2-Day Battery | US Version | 3\/64GB | 6.39-Inch Screen | Triple Camera | Fjord Blue : Cell Phones & Accessories"},"prices":{"0":"$1,199.99","1":"$917.33","2":"$278.63","3":"$415.00","4":"$750.00","5":"$515.00","6":"$94.99","7":"$299.00","8":"$799.99","9":"$149.99","10":"$39.88","11":"$133.54","12":"$384.00","13":"$49.88","14":"$29.88","15":"$39.99","16":"$29.88","17":"$23.99","18":"$69.00","19":"$304.00","20":"$131.49","21":"$29.26","22":"$49.95 (.$166.50 \/ kg)","23":"$160.01"},"product_desc":{"0":"About this item\nCAPTURE THE NIGHT IN LOW LIGHT: Whether you’re headed to a concert or romantic night out, there’s no such thing as bad lighting with Night Mode; Galaxy S23 Ultra lets you capture epic content in any setting with stunning Nightography\nHIGHEST PHONE CAMERA RESOLUTION: Create crystal-clear content worth sharing with Galaxy S23 Ultra’s 200MP camera — the highest camera resolution on a phone; Whether you’re posting or printing, Galaxy S23 Ultra always does the moment justice\nSTUNNINGLY SMOOTH VIDEO: Capture incredibly smooth video during life’s most exciting moments; With Video Stabilization, this smartphone easily records daytime outdoor adventures or those spur-of-the-moment dance parties at night\nWRITE, DRAW, CREATE w\/ S PEN: Whether you’re in Samsung Note, Microsoft Office or Google Suite, with the built-in S Pen, you can convert handwriting to text, share your creations live and keep everything on your Galaxy S23 Ultra device\nSNAP PICS w\/ S PEN: Capture epic selfies and beautiful photos with the click of your S Pen; Simply open up the camera app and click the button on the S Pen instead of the screen; Getting that great shot just got easier\nFASTEST MOBILE PROCESSOR AVAILABLE: Whether you’re working hard, playing hard or doing both at the same time, smoothly switch between apps with our fastest processor ever\nUNLOCK SMOOTH GAMING: Game at full throttle and smoothly switch between apps; Get more done with our fastest processor ever combined with massive internal storage; And if you’re on the move, keep going with a screen that adapts to your environment\nShow more","1":"About this item\nUnlocked\nTested for battery health and guaranteed to come with a battery that exceeds 90% of original capacity.\nInspected and guaranteed to have minimal cosmetic damage, which is not noticeable when the device is held at arm’s length. Successfully passed a full diagnostic test which ensures like-new functionality and removal of any prior-user personal information.\nIncludes a brand new, generic charging cable that is certified Mfi (Made for iPhone) and a brand new, generic wall plug that is UL certified for performance and safety. Also includes a SIM tray removal tool but does not come with headphones or a SIM card.\nBacked by the same one-year satisfaction guarantee as brand new Apple products.","2":"About this item\nThis phone is unlocked and compatible with any carrier of choice on GSM and CDMA networks (e.g. AT&T, T-Mobile, Sprint, Verizon, US Cellular, Cricket, Metro, Tracfone, Mint Mobile, etc.).\nPlease check with your carrier to verify compatibility.\nWhen you receive the phone, insert a SIM card from a compatible carrier. Then, turn it on, connect to Wi-Fi, and follow the on screen prompts to activate service.\nThe device does not come with headphones or a SIM card. It does include a generic (Mfi certified) charger and charging cable.\nTested for battery health and guaranteed to have a minimum battery capacity of 80%.","3":"About this item\nThis phone is unlocked and compatible with any carrier of choice on GSM and CDMA networks (e.g. AT&T, T-Mobile, Sprint, Verizon, US Cellular, Cricket, Metro, Tracfone, Mint Mobile, etc.).\nTested for battery health and guaranteed to have a minimum battery capacity of 80%.\nSuccessfully passed a full diagnostic test which ensures like-new functionality and removal of any prior-user personal information.\nThe device does not come with headphones or a SIM card. It does include a generic (Mfi certified) charger and charging cable.\nInspected and guaranteed to have minimal cosmetic damage, which is not noticeable when the device is held at arm's length.","4":"About this item\nUnlocked and compatible with any carrier of choice on GSM and CDMA networks (e.g. AT&T, T-Mobile, Sprint, Verizon, US Cellular, Cricket, Metro, Tracfone, Mint Mobile, etc.).\nTested for battery health and guaranteed to come with a battery that exceeds 90% of original capacity.\nInspected and guaranteed to have minimal cosmetic damage, which is not noticeable when the device is held at arm's length. Successfully passed a full diagnostic test which ensures like-new functionality and removal of any prior-user personal information.\nIncludes a brand new, generic charging cable that is certified Mfi (Made for iPhone) and a brand new, generic wall plug that is UL certified for performance and safety. Also includes a SIM tray removal tool but does not come with headphones or a SIM card.\nBacked by a one-year satisfaction guarantee.","5":"About this item\nThis phone is unlocked and compatible with any carrier of choice on GSM and CDMA networks (e.g. AT&T, T-Mobile, Sprint, Verizon, US Cellular, Cricket, Metro, Tracfone, Mint Mobile, etc.).\nTested for battery health and guaranteed to come with a battery that exceeds 90% of original capacity.\nBacked by a one-year satisfaction guarantee, with free access to Amazon’s Technical Support team throughout the full year and ability to replace or return the product if it does not work as expected.\nIncludes a brand new, generic charging cable that is certified Mfi (Made for iPhone) and a brand new, generic wall plug that is UL certified for performance and safety. Also includes a SIM tray removal tool but does not come with headphones or a SIM card.\nInspected and guaranteed to have minimal cosmetic damage, which is not noticeable when the device is held at arm’s length. Successfully passed a full diagnostic test which ensures like-new functionality and removal of any prior-user personal information.","6":"About this item\nCarrier compatibility: AT and T: VoLTE, Verizon: VoLTE, T Mobile: VoLTE, WiFi Calling, Video Calling, Tracfone: GSM, Spectrum: VoLTE, WiFi Calling. Does not support: Boost: Republic Wireless, Tracfone (CDMA), Straight Talk Wireless (CDMA), Xfinity Wireless. For all carrier compatibility details - please check the product images in detail.Form_factor : smartphone.Other camera description:Front,Rear\nMeet Moto G Pure and get more of what you love. An ultra-wide view of your favorite movies, games, and video chats on a 6.5 Max Vision HD plus display. Plus, a two-day battery to keep the fun going all weekend long. And there’s more. Dual camera system with Night Vision. Super-responsive processor. Water-repellent design. With Moto G Pure, more comes standard.\nMediaTek Helio G25 processor. Super-responsive performance. Feel your phone respond instantly to every touch, tap, and swipe using an octa-core processor with HyperEngine.\n13MP Dual Camera System. Dual camera system with Night Vision. Capture beautiful portraits with a blur effect and take incredibly vivid photos in the dark. FRONT CAMERA\/ 5MP (f\/2.4, 1.12um)\n6.5 Max Vision HD plus display. Bring your favorite games, movies, and video chats to life on a stunning ultra-wide screen.\nTwo-day battery. Keep the fun going all weekend long with a 4000 mAh battery.\nWater-repellent design. Keep your phone safe from accidental spills and splashes.\nShow more","7":"About this item\nGoogle Pixel 6a adapts to you; it’s super fast and secure and powered by Google Tensor, the first chip designed by Google just for Pixel.Form_factor : Bar.Other camera description:Front,Rear\nUnlocked Android 5G phone gives you the flexibility to change carriers and choose your own data plan[1]; works with Google Fi, Verizon, T-Mobile, AT&T, and other major carriers\nPixel’s fast-charging all-day battery adapts to you and saves power for the apps you use most[2]\nTake amazing photos with Pixel’s 12 megapixel camera and tools like Magic Eraser[3], Motion Mode, and Portrait Mode\nWith Google Tensor, your phone launches apps fast, pages and images load quickly, and everything runs smoothly\nWhen you plug it in, Pixel 6a charges super fast[4]; with just a few minutes of charging, your phone gets hours of power (adapters sold separately)\nLive Translate helps you translate live video captions, private chats, and messages, and signs in up to 55 languages right on your cell phone[5]\nShow more","8":"About this item\n8K SUPER STEADY VIDEO: Shoot videos that rival how epic your life is with stunning 8K recording, the highest recording resolution available on a smartphone; Video captured is effortlessly smooth, thanks to Auto Focus Video Stabilization on Galaxy S22 Ultra.Form_factor : Smartphone\nNIGHTOGRAPHY plus PORTAIT MODE: Capture the night with crystal clear, bright pics and videos, no matter the lighting with Night Mode; Portrait Mode auto-detects and adjusts to what you want front and center, making all your photos worthy of a frame\n108MP PHOTO RESOLUTION plus BRIGHT DISPLAY: Capture premium detail with 108MP resolution— the highest available on a cell phone; Your favorite content will look even more epic on our brightest display ever with Vision Booster\nADAPTIVE COLOR CONTRAST: Streaming on the go, working from your patio or binge-watching late into the night. The Galaxy S22 Ultra adaptive screen automatically optimizes color and brightness, outdoors and indoors\nLONG LASTING BATTERY plus FAST CHARGING: Power every scroll, click, tap and stream all day long and then some with an intelligent, long-lasting battery; Dive back into action at a moment’s notice with 45W Super-Fast Charging\nEMBEDDED S PEN: New phone, new S Pen; Now you can unleash your creativity on Galaxy S22 Ultra with an embedded S Pen; Edit photos and videos with pinpoint accuracy, and do it all with that pen-to-paper feel\nPREMIUM DESIGN & CRAFTMANSHIP: With a classy, eye-catching glass-metal-glass design, we’re setting a standard for smart phones; With our strongest aluminum frame and the latest Gorilla Glass, this phone is lightweight and durable to help endure scratches and dings","9":"About this item\n5G Unlocked for T-mobile and Google Fi. 4G Compatible with T-Mobile, AT&T, Verizon and Google Fi. Powered by the latest Qualcomm 5G chipset, the OnePlus Nord N200 5G allows you to download or stream your favorite TV shows, connect with your social media, and play online multiplayer at blazing fast speeds..Other camera description:Rear,Front\n6.49” Full HD+ LCD Display, 90Hz Smooth Display - Immerse yourself in all your favorite movies, TV shows, and video games with N200 5G’s 6.49” crystal clear Full HD+ display.\n90Hz Smooth Display - The 90Hz refresh rate refreshes 50% faster than standard 60Hz displays, ensuring smooth navigation and scrolling across the home screen and your applications.\nLarge 5000mAh battery - The OnePlus Nord N200 5G is powered by a massive 5000mAh battery, providing all the power required to get you through the day. Watch hours of TV, play graphically intense games, or browse the internet non-stop without fear of your device dying.\n18W Fast Charging - The N200 5G’s 18W fast charging gets you refilled and back on your feet quickly.\n4GB RAM + 64GB built-in storage (expandable up to 256GB) - The OnePlus Nord N200 5G packs all the performance power and storage you’ll need to run and store your favorite content. 4GB of RAM ensures your applications and content run smoothly, making for a seamless, customizable, and enjoyable mobile experience. The 64GB of built-in storage ensures you can have all your favorite films, TV shows, games, and photos with you on the go. Need more storage? Expand it by up to 256GB with a microSD card.\n13MP Triple Camera System - It’s easy to capture every moment with clarity thanks to the 13MP main camera. Take up close and personal shots with the macro lens and add some definition to your black-and-white photos with the mono lens.\nSingle-SIM. If your device is not receiving text messages or experiencing error when making phone calls, you need to contact carriers' technical support to add CDMALess feature. Support 2.4G\/5G, WiFi 802.11 a\/b\/g\/n\/ac","10":"About this item\nThe large 3000 mAh battery with Smart Manager optimization can easily handle your daily demands with more than 14 hours of mixed usage in a single charge. A powerful Octa-core processor provides a smooth multitasking experience.Optical sensor resolution:5 megapixels.Display Type:LCD.Form_factor : Bar\nTake sharp pictures with the 8MP rear camera and record steady videos in high definition. The 5MP selfie camera with Portrait mode allows you to share stylish portraits with a blurred background effect.\n3GB RAM \/ 32GB Internal Storage | MicroSD up to 512GB\nCarrier: This phone is locked to Tracfone, which means this device can only be used on the Tracfone wireless network.\nUnlimited Talk, Text and Data plans starting as low as dollar 20\/month","11":"About this item\nCarrier compatibility: AT&T: VoLTE, Verizon: VoLTE, T Mobile: VoLTE, WiFi Calling, Video Calling, Tracfone: GSM, CDMA Does not support:Boost, U.S. Cellular, Xfinity Wireless, Spectrum, Optimum Mobile. For all carrier compatibility details - please check the product images in detail.Maximum display resolution:1080x2460 .Display Type:IPS.Form_factor : smartphone.Display resolution maximum:1080x2460.Other camera description:Front,Rear\nBuilt-in stylus. Sketch freely, add handwritten notes to photos, and edit images with precision using a push-pen stylus. Up to 2-day battery life. Get creative, play games, or binge watch your favorite series without worry thanks to a 5000 mAh battery. Versatile 50 MP camera system. Capture everything from breathtaking ultra-wide images to extreme close-ups.\n6.8\" Max Vision FHD+ display. Bring movies, videos, and games to life, and view your notes and sketches in Full HD+ detail.\nFast, fluid 90 Hz refresh rate. View content on a screen that’s smooth and seamless, virtually free from annoying lag.\nOcta-core processor and 128 GB storage. Enjoy powerful performance to create effortlessly—and plenty of room to hold everything. Operating System: Android 11\nWi-Fi Hotspot Ready: Moto G Stylus (2022) offers Wi-fi hotspot connectivity in 2.4 GHz , 5 GHz for the best experience. In-box: Moto G Stylus (2022), 10W rapid Charger, USB Cable, Guides, SIM tool.\nSensors: Proximity, Ambient Light, Accelerometer, Gyroscope, SAR, Sensor Hub, Fingerprint reader","12":"About this item\nFully unlocked and compatible with any carrier of choice (e.g. AT&T, T-Mobile, Sprint, Verizon, US-Cellular, Cricket, Metro, etc.).\nThe device does not come with headphones or a SIM card. It does include a charger and charging cable that may be generic.\nInspected and guaranteed to have minimal cosmetic damage, which is not noticeable when the device is held at arm's length.\nSuccessfully passed a full diagnostic test which ensures like-new functionality and removal of any prior-user personal information.\nTested for battery health and guaranteed to have a minimum battery capacity of 80%.","13":"About this item\nWe’ve crunched some numbers and discovered that three camera lenses means three times the fun. With the Samsung Galaxy A03s you got 13MP Multi-Lens Camera composed by 13MP (F2.2) Wide, 2MP (F2.4) Macro, 2MP (F2.4) Depth.Optical sensor resolution:2 megapixels.Display Type:LCD.Form_factor : Bar\nWhen you’re on the go, responsive processing speed is what you need. Galaxy A03s has you covered with the Octa-core Processor.\nThe Samsung Galaxy A03s counts on a 5,000mAh reliable, long-lasting battery that helps you keep going at your pace.\nCarrier: This phone is locked to Tracfone, which means this device can only be used on the Tracfone wireless network.\nYour cherished moments are essential, so keep them with expandable storage of 32GB and with a RAM of 3GB.\nHigh-def display —Bold and brilliant with a crisp infinity 6.5\" HD plus LCD 720 x 1600 display that’s perfect for keeping in touch or escaping into your entertainment. 802.11 a\/b\/g\/n, 2.4 GHz, Bluetooth v5.0","14":"About this item\nCarrier: This phone is locked to Total by Verizon, which means this device can only be used on the Total by Verizon wireless network.\nPower, save, and savor everything you do with a 3,000mAh battery.\nA 8MP rear camera powered by Google Lens with the ability to capture moments you'll love watching back on a 6.1\" HD+ NXTVISION display.\n32GB of expandable memory, 3GB Ram, Bluetooth 5.0\nCompatible with our no-contract talk, text & data plans that start at $30\/mo.","15":"About this item\nSUPERIOR PROTECTION: InvisiGlass Ultra's ultra-tough top layer for iPhone 11 is tested and proven to provide the highest level of edge-to-edge protection against drops, impacts, and scratches\nCRYSTAL CLEAR: The tempered glass is treated with an anti-smudge and fingerprint coating that also helps this screen cover resist discoloration and maintain optimal clarity, so it feels like nothing is there at all\nMADE TO LAST: The perfect fit for your iPhone, it's durably made with strengthened glass that’s 40% stronger than standard tempered glass to provide superior resistance and ultimate protection\nULTRA-THIN DESIGN: InvisiGlass boasts a slim design of just 0.29mm thick to ensure a flawless tactile response; this means touchscreen sensitivity is never compromised!\nEASY ALIGN TRAY INCLUDED: Applying this screen protector to your phone from the comfort of your home is made easy with the included Easy Align Tray. Application instructions included.","16":"About this item\nCarrier: This phone is locked to Total by Verizon, which means this device can only be used on the Total by Verizon wireless network.\nPower, save, and savor everything you do with a 3,000mAh battery.\nA 8MP rear camera powered by Google Lens with the ability to capture moments you'll love watching back on a 6.1\" HD+ NXTVISION display.\n32GB of expandable memory, 3GB Ram, Bluetooth 5.0\nCompatible with our no-contract talk, text & data plans that start at $30\/mo.","17":"About this item\nRapid Charging: This USB C PD 3.0 certified charger is built with fast charging technology for any Apple (iPhone 14 \/ 13 \/ 12 \/ 11 \/ X series) and Android (Samsung Galaxy S23 Ultra, S22, S21, Note 20, Google Pixel 7, 7 Pro, 7a, 6, 6 Pro) devices to fully charge your phone in 90 minutes (Up to 30W Max)\nCompact & Powerful: 50% smaller than a normal 30 W charger with a foldable plug for easy storage, this USB C charger is small, portable, and can easily be stored in any backpack, purse, pouch, or pocket; Semi-transparent material gives insight into the internal parts and processes of the charger with a burst of color that brightens up the space you are charging in\nUpgraded Technology & Safety: By swapping out silicon for Gallium Nitride (GaN) we've been able to fit 30W of power into this sleek charger that works flawlessly with nearly all mobile devices, tablets, and more at full 30W speed; Additionally, the smart GaN and Programmable Power Supply (PPS) Technology automatically optimizes the output voltage depending on the device connected, to safely charge your devices and produce less heat. Also, the charger is PD 3.0 certified, meaning it can deliver a fast and safe charge to your device\n1-Year Warranty: This charger block is covered by a 1-year warranty for any manufacturer defects\nPackage Contents: 1 Unit of Fuel Brites 30W Fast USB C Charger - Vibrant Orange (USB Cable not included)","18":"About this item\nThis device works with all GSM carriers including, but not limited to: AT&T, Boost, Cricket, H2O Wireless, Metro, Net10, T-Mobile, Tracfone. This product will not work with Verizon or Verizon subsidiaries. Please confirm compatibility and network availability with your preferred carrier..Other camera description:Rear\nKeep the conversations flowing with WhatsApp and Facebook.\nStream what you like, when you like on YouTube\nEnjoy the ease of 4G and share a connection with the WiFi hotspot\nGet answers, call friends or organize plans in an instant with Google Assistant","19":"About this item\nWill NOT work on Verizon AT&T\/BOOST\/CRICKET\/METRO PCS or any CDMA Carrier. 5G + 4G VoLTE Worldwide Unlocked Dual Nano sim FCC ID: 2AFZZ16UG.\nWill NOT work on Verizon AT&T\/BOOST\/CRICKET\/METRO PCS or any CDMA Carrier. 5G + 4G VoLTE Worldwide Unlocked Dual Nano sim FCC ID: 2AFZZ16UG.\nDual Nano Sim 5G:5G: n1\/3\/5\/7\/8\/20\/ 4G: LTE FDD:1\/2\/3\/4\/5\/7\/8\/12\/13\/17\/18\/32\/66 4G: LTE TDD:38\/40\/41 3G: WCDMA:1\/2\/4\/5\/8\/19 SIM 1 + Hybrid (SIM or MicroSD) 2G: GSM: 850 900 1800 1900MHz\n6.67\" FHD+ AMOLED DotDisplay Refresh rate: Up to 120Hz Contrast ratio: 4,500,000:1 Resolution: 2400 x 1080\nOcta-core (2x2.5 GHz Cortex-A78 & 6x2.0 GHz Cortex-A55).5 GHz GPU: ARM Mali-G68 Bluetooth 5.1 Wi-Fi Protocol: 802.11a\/b\/g\/n\/ac\nGPS L1 | Glonass G1 | BDS B1 | Galileo E1 Dual speakers 3.5mm headphone jack Hi-Res Audio Proximity sensor | Ambient light sensor | Accelerometer | Electronic compass | IR blaster ｜Gyroscopecertification\n108MP wide camera f\/1.9 0.7μm, 9-in-1 binning into one large 2.1μm pixel 1\/1.52” sensor size 8MP ultra-wide camera f\/2.2 FOV 118° 2MP macro camera f\/2.4 16MP front camera f\/2.4 4K@30fps, 1080p@30\/60\/120fps, 720p@960fps","20":"About this item\nGet a phone that can handle more of what you throw at it with Durable Gorilla Glass 5.\nA long-lasting and fast-charging 5,000mAh battery, and 64\/128GB of internal storage that you can expand up to 1TB.\nAll set for you to capture live as it is with the powerfull 50MP main camera\nThis phone is locked for use with SIMPLE Mobile.\nCompatible with SIMPLE Mobile Unlimited talk, text & data plans starting at $25\/mo.","21":"About this item\nInstant Bike Dashboard: Perfect for any enthusiast, delta’s bicycle phone mount allows you to securely display your mobile device while riding. Compatible with phones up to 3.5” wide, .5” depth, 7.8” length (up to iPhone 14+ Plus and Samsung Galaxy 23+ plus).\nMultiple Mounting Options: Included handlebar and stem cap mounts allow you to position your mobile phone in your desired location. Securely mounts to handlebar diameters up to 1 3\/8” \/ 31.8mm.\nRide with Confidence: Featuring a built-in lock mechanism, your plus-sized smartphone is secured safely with multiple grip points and bumpers, to prevent shock and reduce vibration on rough terrain. Adjust the angle of display for convenient viewing while riding to easily access navigation, answer that important call or stop for the perfect photo opportunity.\nQuality Construction: Your mobile phone is fully enclosed and securely mounted in place with a built-in locking mechanism. Precision engineered design grips your device, providing ease-of-mind on the roughest terrain.","22":"Certified Made For Google: This product has been certified by Google to work with Qi compatible Google Pixel phones, including the Google Pixel 3, 4, 5 ,6, and 7\nWireless Fast Charging: Qi-certified technology allows you to wirelessly charge your iPhone (7.5W) or Android (10W) without connecting your phone to a power cable.\nEasy One Touch Mechanism: Press the locking side arms with a quick one-handed motion, and place your phone against the trigger button. The mount’s arms will close automatically, holding your device securely while you drive. Mount or remove your phone in seconds with the patented Easy One Touch Mechanism.\nMultiple Installation Options: The Mount contains two mounting brackets. A CD slot connector and an Air Vent Bracket.\nAdjustable Bottom Foot: The foot of the mount can be raised and lowered to accommodate phones of various sizes. This helps to align the Qi coils for an efficient charging experience.\nCase Compatibility: The wireless charging feature works with Qi compatible devices and cases up to 6mm thick. For the most efficient wireless charging experience, we recommend connecting your phone without a case.","23":"About this item\nGet up to 70% better performance compared to previous generations, thanks to the newest qualcomm snapdragon 460 mobile platform..Form_factor : Slate.Display resolution maximum:720 x 1560 pixels\nEnjoy all your favorite entertainment in 6.39-inch immersive hd+ with punch hole display for maximized screen real estate.\nCharge less and get up to two days on a single charge with the adaptive battery. capture the perfect shot with triple camera ai imaging, portrait mode, night mode and the ultrawide lens.\nTake in a truly timeless design that's built to last, with a durable 3d nano-textured rear cover and stunning finish in living colors.\nCompatibility: This device is designed to work with GSM carriers. This product will not support Verizon or Verizon subsidiaries. Please confirm compatibility with your chosen carrier before purchasing. For support with SIM card or network related issues, please contact your carrier for assistance in connecting your device to the chosen compatible network."},"ratings":{"0":"4.6 out of 5","1":"4.1 out of 5","2":"4.3 out of 5","3":"4.2 out of 5","4":"4.4 out of 5","5":"4.3 out of 5","6":"4 out of 5","7":"4.3 out of 5","8":"4.6 out of 5","9":"4.1 out of 5","10":"4 out of 5","11":"4.3 out of 5","12":"4.2 out of 5","13":"4.2 out of 5","14":"3.9 out of 5","15":"4.4 out of 5","16":"3.9 out of 5","17":"4.4 out of 5","18":"3.6 out of 5","19":"4.5 out of 5","20":"5 out of 5","21":"4.4 out of 5","22":"4.2 out of 5","23":"3.7 out of 5"},"total_ratings":{"0":"193 ratings","1":"821 ratings","2":"11,926 ratings","3":"18,432 ratings","4":"1,552 ratings","5":"14,401 ratings","6":"979 ratings","7":"4,437 ratings","8":"599 ratings","9":"2,096 ratings","10":"1,213 ratings","11":"1,458 ratings","12":"9,543 ratings","13":"887 ratings","14":"76 ratings","15":"757 ratings","16":"76 ratings","17":"147 ratings","18":"396 ratings","19":"724 ratings","20":"5 ratings","21":"817 ratings","22":"1,970 ratings","23":"465 ratings"},"links":{"0":"https:\/\/www.amazon.com\/SAMSUNG-Factory-Unlocked-Android-Smartphone\/dp\/B0BLP3ZZXT\/ref=sr_1_12?keywords=iphone&qid=1689513476&sr=8-12","1":"https:\/\/www.amazon.com\/iPhone-Pro-Max-128GB-Gold\/dp\/B0BGYDDWDF\/ref=sr_1_4?keywords=iphone&qid=1689513476&sr=8-4","2":"https:\/\/www.amazon.com\/Apple-iPhone-SE-128GB-Black\/dp\/B088NMH5KL\/ref=sr_1_6?keywords=iphone&qid=1689513476&sr=8-6","3":"https:\/\/www.amazon.com\/Apple-iPhone-256GB-Unlocked-Renewed\/dp\/B07ZQRL9XY\/ref=sr_1_3?keywords=iphone&qid=1689513476&sr=8-3","4":"https:\/\/www.amazon.com\/Apple-iPhone-12-Pro-Max\/dp\/B09JFS16CP\/ref=sr_1_5?keywords=iphone&qid=1689513476&sr=8-5","5":"https:\/\/www.amazon.com\/Apple-iPhone-Pro-256GB-Gold\/dp\/B08BHHRZQG\/ref=sr_1_2?keywords=iphone&qid=1689513476&sr=8-2","6":"https:\/\/www.amazon.com\/battery-Unlocked-Motorola-Camera-Indigo\/dp\/B09BTB5MKT\/ref=sr_1_14?keywords=iphone&qid=1689513476&sr=8-14","7":"https:\/\/www.amazon.com\/Google-Pixel-6a-Smartphone-Megapixel\/dp\/B0B3PSRHHN\/ref=sr_1_10?keywords=iphone&qid=1689513476&sr=8-10","8":"https:\/\/www.amazon.com\/SAMSUNG-Smartphone-Unlocked-Brightest-Processor\/dp\/B09MVZH5RB\/ref=sr_1_11?keywords=iphone&qid=1689513476&sr=8-11","9":"https:\/\/www.amazon.com\/OnePlus-Unlocked-Android-Smartphone-Charging\/dp\/B07XWGWPH5\/ref=sr_1_13?keywords=iphone&qid=1689513476&sr=8-13","10":"https:\/\/www.amazon.com\/Tracfone-Alcatel-TCL-32GB-Black\/dp\/B09CLN4LLN\/ref=sr_1_9?keywords=iphone&qid=1689513476&sr=8-9","11":"https:\/\/www.amazon.com\/Stylus-battery-Unlocked-Motorola-Twilight\/dp\/B09PFC2DVD\/ref=sr_1_8?keywords=iphone&qid=1689513476&sr=8-8","12":"https:\/\/www.amazon.com\/Apple-iPhone-12-64GB-Black\/dp\/B08PP5MSVB\/ref=sr_1_1?keywords=iphone&qid=1689513476&sr=8-1","13":"https:\/\/www.amazon.com\/Tracfone-Samsung-Galaxy-A03s-Black\/dp\/B09T2JFWKR\/ref=sr_1_15?keywords=iphone&qid=1689513476&sr=8-15","14":"https:\/\/www.amazon.com\/Total-Verizon-TCL-32GB-Black\/dp\/B0BBXBXCFC\/ref=sr_1_16?keywords=iphone&qid=1689513476&sr=8-16","15":"https:\/\/www.amazon.com\/sspa\/click?ie=UTF8&spc=MTo1OTA1MTc4MTEwOTI5ODU6MTY4OTUxNDA0MzpzcF9hdGZfbmV4dDozMDAwMDEwNjYzODM2MDI6OjA6Og&url=%2FBelkin-Protector-Antimicrobial-Treated-Strengthened-Installation%2Fdp%2FB08VH86SMM%2Fref%3Dsr_1_17_sspa%3Fkeywords%3Diphone%26qid%3D1689514043%26sr%3D8-17-spons%26sp_csd%3Dd2lkZ2V0TmFtZT1zcF9hdGZfbmV4dA%26psc%3D1","16":"https:\/\/www.amazon.com\/Total-Verizon-TCL-32GB-Black\/dp\/B0BBXBXCFC\/ref=sr_1_20?keywords=iphone&qid=1689514043&sr=8-20","17":"https:\/\/www.amazon.com\/sspa\/click?ie=UTF8&spc=MTo1OTA1MTc4MTEwOTI5ODU6MTY4OTUxNDA0MzpzcF9hdGZfbmV4dDoyMDAxNTk0MTE4Mjg2OTg6OjA6Og&url=%2FiPhone-Charger-Fast-Charging-Foldable%2Fdp%2FB0BBSMXGCQ%2Fref%3Dsr_1_18_sspa%3Fkeywords%3Diphone%26qid%3D1689514043%26sr%3D8-18-spons%26sp_csd%3Dd2lkZ2V0TmFtZT1zcF9hdGZfbmV4dA%26psc%3D1","18":"https:\/\/www.amazon.com\/Nokia-Unlocked-Hotspot-Social-Assistant\/dp\/B0939D9FR3\/ref=sr_1_19?keywords=iphone&qid=1689514043&sr=8-19","19":"https:\/\/www.amazon.com\/Xiaomi-Version-Unlocked-Verizon-Cricket\/dp\/B09VNW56HZ\/ref=sr_1_21?keywords=iphone&qid=1689514043&sr=8-21","20":"https:\/\/www.amazon.com\/Simple-Mobile-Samsung-Galaxy-Black\/dp\/B0BBXX3RLK\/ref=sr_1_37?keywords=iphone&qid=1689514238&sr=8-37","21":"https:\/\/www.amazon.com\/sspa\/click?ie=UTF8&spc=MTo1NDA1NDQ2Mzg4MjY2ODMwOjE2ODk1MTQyMzg6c3BfYXRmX25leHQ6MjAwMTY2NzI5NjkwMDk4OjowOjo&url=%2FBicycle-Phone-Holder-Bike-Mount%2Fdp%2FB00K8PYT2M%2Fref%3Dsr_1_34_sspa%3Fkeywords%3Diphone%26qid%3D1689514238%26sr%3D8-34-spons%26sp_csd%3Dd2lkZ2V0TmFtZT1zcF9hdGZfbmV4dA%26psc%3D1","22":"https:\/\/www.amazon.com\/sspa\/click?ie=UTF8&spc=MTo1NDA1NDQ2Mzg4MjY2ODMwOjE2ODk1MTQyMzg6c3BfYXRmX25leHQ6MjAwMDIzNTk0NTk3NjQxOjowOjo&url=%2FiOttie-Wireless-Charger-Charging-Smartphones%2Fdp%2FB07X52DJ66%2Fref%3Dsr_1_33_sspa%3Fkeywords%3Diphone%26qid%3D1689514238%26sr%3D8-33-spons%26sp_csd%3Dd2lkZ2V0TmFtZT1zcF9hdGZfbmV4dA%26psc%3D1","23":"https:\/\/www.amazon.com\/Nokia-Android-Unlocked-Smartphone-6-39-Inch\/dp\/B08MWX1THP\/ref=sr_1_35?keywords=iphone&qid=1689514238&sr=8-35"},"asin":{"0":"B0BLP3ZZXT","1":"B0BGYDDWDF","2":"B088NMH5KL","3":"B07ZQRL9XY","4":"B09JFS16CP","5":"B08BHHRZQG","6":"B09BTB5MKT","7":"B0B3PSRHHN","8":"B09MVZH5RB","9":"B07XWGWPH5","10":"B09CLN4LLN","11":"B09PFC2DVD","12":"B08PP5MSVB","13":"B09T2JFWKR","14":"B0BBXBXCFC","15":"B08VH86SMM","16":"B0BBXBXCFC","17":"B0BBSMXGCQ","18":"B0939D9FR3","19":"B09VNW56HZ","20":"B0BBXX3RLK","21":"4.25 x 2 x 6.75 inches","22":"B07X52DJ66","23":"B08MWX1THP"}}